# CoreOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..CoreOffset Property
EnergyDataSettings Class See Also
---
The default offset used to determine the outer perimeter to be divided into zones.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double CoreOffset { get; set; }
```

Visual Basic
---
```text
Public Property CoreOffset As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double CoreOffset {
	double get ();
	void set (double value);
}
```

# Remarks
A Zone can be either a Mass Zone or an Analytical Space depending on whether the AnalysisType is ConceptualMasses or otherwise. Specifying a value here determines the zone depth and creates a core zone.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for coreOffset must be between 0 and 30000 feet. |

# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace